# âž¥ Binning

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import KBinsDiscretizer
from sklearn.metrics import accuracy_score
from sklearn.tree import DecisionTreeClassifier

In [2]:
titanic = pd.read_csv('train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic = titanic.iloc[:,[1,5,9]]
titanic.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [4]:
titanic.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [5]:
titanic.dropna(inplace=True)
titanic.isnull().sum()

Survived    0
Age         0
Fare        0
dtype: int64

In [6]:
X_train,X_test,y_train,y_test = train_test_split(titanic.iloc[:,1:],titanic.iloc[:,0],test_size=0.2,random_state=0)

In [7]:
X_train

      Age      Fare
387  36.0   13.0000
685  25.0   41.5792
20   35.0   26.0000
331  45.5   28.5000
396  31.0    7.8542
..    ...       ...
883  28.0   10.5000
238  19.0   10.5000
789  46.0   79.2000
704  26.0    7.8542
856  45.0  164.8667

[571 rows x 2 columns]

In [8]:
kbin_age_fare = KBinsDiscretizer(n_bins=10,encode='ordinal',strategy='quantile')
# kbin_fare = KBinsDiscretizer(n_bins=10,encode='ordinal',strategy='quantile')

In [9]:
tf_kbin = ColumnTransformer(transformers=[('kbin_age',kbin_age_fare,[0]),
                                          ('kbin_fare',kbin_age_fare,[1])],
                            remainder='passthrough')

In [10]:
X_train_tf = tf_kbin.fit_transform(X_train)
X_test_tf = tf_kbin.fit_transform(X_test)

In [11]:
tf_kbin.named_transformers_['kbin_age'].n_bins_

array([10])

In [12]:
output = pd.DataFrame({
    'age':X_train['Age'],
    'age_tf':X_train_tf[:,0],
    'fare':X_train['Fare'],
    'fare_tf':X_train_tf[:,1]
})

In [ ]:
output['age_labels'] = pd.cut(x=X_train['Age'],
                                    bins=tf_kbin.named_transformers_['kbin_age'].bin_edges_[0].tolist())
output['fare_labels'] = pd.cut(x=X6_train['Fare'],
                                    bins=tf_kbin.named_transformers_['kbin_fare'].bin_edges_[0].tolist())

In [ ]:
output.head()

In [ ]:
clf = DecisionTreeClassifier()
clf.fit(X6_train_tf,y6_train)

In [ ]:
y6_pred = clf.predict(X6_test_tf)
y6_pred

In [ ]:
accuracy = accuracy_score(y6_test,y6_pred)
accuracy